# Практическая работа 5: Вложенные циклы и графика через символы

## Цель работы

Научиться использовать вложенные циклы для создания графических паттернов с помощью символов, а также решать задачи, требующие нескольких уровней итерации.

## Теоретическая часть

Вложенные циклы - это циклы, которые находятся внутри других циклов. Внешний цикл управляет одной размерностью, а внутренний - другой. Вложенные циклы особенно полезны для:

- Создания двумерных структур данных
- Генерации таблиц умножения
- Создания графических паттернов
- Обработки двумерных данных

```python
# Пример вложенного цикла
for i in range(3):        # Внешний цикл
    for j in range(2):    # Внутренний цикл
        print(f"i={i}, j={j}")
    print("---")  # После завершения внутреннего цикла
```

## Практические задания

### Задание 1: Прямоугольник из звездочек

Напишите программу, которая запрашивает у пользователя ширину и высоту прямоугольника, а затем выводит его из звездочек (*).

**Пример выполнения:**
```
Введите ширину: 5
Введите высоту: 3
*****
*****
*****
```

**Код для выполнения:**
```python
width = int(input("Введите ширину: "))
height = int(input("Введите высоту: "))

for i in range(height):
    for j in range(width):
        print("*", end="")
    print()  # Переход на новую строку после каждой строки прямоугольника
```

---

### Задание 2: Треугольник из звездочек

Создайте программу, которая выводит прямоугольный треугольник из звездочек, где количество звездочек в строке соответствует номеру строки.

**Пример выполнения:**
```
Введите высоту треугольника: 5
*
**
***
****
*****
```

**Код для выполнения:**
```python
height = int(input("Введите высоту треугольника: "))

for i in range(1, height + 1):
    for j in range(i):
        print("*", end="")
    print()
```

---

### Задание 3: Ёлочка

Создайте программу, которая выводит ёлочку из звездочек. Каждый уровень ёлочки должен быть на 2 звездочки шире предыдущего, и уровни должны быть центрированы.

**Пример выполнения:**
```
Введите высоту ёлочки: 4
   *
  ***
 *****
*******
   |
```

**Код для выполнения:**
```python
height = int(input("Введите высоту ёлочки: "))

# Определяем максимальную ширину для центровки
max_width = 2 * height - 1

for i in range(height):
    stars = 2 * i + 1
    spaces = (max_width - stars) // 2
    
    # Выводим пробелы для центровки
    for j in range(spaces):
        print(" ", end="")
    
    # Выводим звездочки
    for k in range(stars):
        print("*", end="")
    
    print()  # Переход на новую строку

# Выводим ствол
spaces = (max_width - 1) // 2
for j in range(spaces):
    print(" ", end="")
print("|")
```

---

### Задание 4: Таблица умножения

Создайте программу, которая выводит таблицу умножения размером 9x9.

**Пример выполнения:**
```
    1   2   3   4   5   6   7   8   9
 1  1   2   3   4   5   6   7   8   9
 2  2   4   6   8  10  12  14  16  18
 3  3   6   9  12  15  18  21  24  27
 ...
```

**Код для выполнения:**
```python
# Выводим заголовок
print("   ", end="")
for col in range(1, 10):
    print(f"{col:3}", end="")
print()

# Выводим строки таблицы
for row in range(1, 10):
    print(f"{row:2} ", end="")
    for col in range(1, 10):
        product = row * col
        print(f"{product:3}", end="")
    print()
```

---

### Задание 5: Шахматная доска

Создайте программу, которая выводит шахматную доску из пробелов и решёток (#), размером 8x8.

**Пример выполнения:**
```
# # # #
 # # # #
# # # #
 # # # #
# # # #
 # # # #
# # # #
 # # # #
```

**Код для выполнения:**
```python
size = 8

for i in range(size):
    for j in range(size):
        # Если сумма индексов четная, рисуем #, иначе пробел
        if (i + j) % 2 == 0:
            print("#", end="")
        else:
            print(" ", end="")
    print()
```

---

### Задание 6: Ромб из звездочек

Создайте программу, которая выводит ромб из звездочек. Пользователь вводит высоту верхней половины ромба.

**Пример выполнения:**
```
Введите высоту верхней половины ромба: 4
   *
  ***
 *****
*******
 *****
  ***
   *
```

**Код для выполнения:**
```python
height = int(input("Введите высоту верхней половины ромба: "))

# Верхняя половина ромба (включая середину)
max_width = 2 * height - 1

for i in range(height):
    stars = 2 * i + 1
    spaces = (max_width - stars) // 2
    
    # Выводим пробелы
    for j in range(spaces):
        print(" ", end="")
    
    # Выводим звездочки
    for k in range(stars):
        print("*", end="")
    
    print()

# Нижняя половина ромба
for i in range(height - 2, -1, -1):
    stars = 2 * i + 1
    spaces = (max_width - stars) // 2
    
    # Выводим пробелы
    for j in range(spaces):
        print(" ", end="")
    
    # Выводим звездочки
    for k in range(stars):
        print("*", end="")
    
    print()
```

---

### Задание 7: Треугольник Паскаля (усложненное)

Создайте программу, которая выводит треугольник Паскаля. Каждое число равно сумме двух чисел над ним.

**Пример выполнения:**
```
Введите количество строк: 6
     1
    1 1
   1 2 1
  1 3 3 1
 1 4 6 4 1
1 5 10 10 5 1
```

**Код для выполнения:**
```python
def factorial(n):
    """Вычисляет факториал числа n"""
    if n <= 1:
        return 1
    result = 1
    for i in range(2, n + 1):
        result *= i
    return result

def combination(n, k):
    """Вычисляет биномиальный коэффициент C(n,k) = n!/(k!(n-k)!)"""
    return factorial(n) // (factorial(k) * factorial(n - k))

rows = int(input("Введите количество строк: "))

# Находим максимальное значение для определения ширины
max_value = combination(rows - 1, (rows - 1) // 2)
max_width = len(str(max_value))

# Выводим треугольник Паскаля
for i in range(rows):
    # Выводим пробелы для центровки
    for space in range(rows - i - 1):
        print(" ", end="")
    
    # Выводим числа строки
    for j in range(i + 1):
        value = combination(i, j)
        print(f"{value:{max_width}}", end="")
        if j < i:  # Не добавляем пробел после последнего числа в строке
            print(" ", end="")
    
    print()
```

---

### Задание 8: Игра "Жизнь" (упрощенная версия)

Создайте программу, которая выводит случайное "поле жизни" размером 10x10, где живые клетки обозначаются символом "O", а мертвые - ".".

**Пример выполнения:**
```
. . O . . O . . . .
O . . . O .
. . . O . . O . . .
. O . . . . . O . .
. . O . . O . . . O
. . . . O .
O . . O . . O . . .
. . O . . . . O . .
. O . . O . . . O .
. . . O . . O . . .
```

**Код для выполнения:**
```python
import random

rows, cols = 10, 10

for i in range(rows):
    for j in range(cols):
        # Случайно решаем, жива клетка или нет (50% шанс)
        if random.random() > 0.5:
            print("O", end=" ")
        else:
            print(".", end=" ")
    print()
```

---

## Контрольные вопросы

1. Что такое вложенные циклы?
2. Как работает внешний и внутренний циклы?
3. Какой цикл завершается первым: внутренний или внешний?
4. Как можно использовать вложенные циклы для создания двумерных структур?
5. Объясните, как работает центровка в задании "Ёлочка".
6. Почему в задании "Шахматная доска" используется выражение `(i + j) % 2`?
7. Как можно оптимизировать вложенные циклы для повышения производительности?

## Вывод

В ходе этой практической работы были освоены вложенные циклы и их применение для создания графических паттернов. Вложенные циклы позволяют эффективно работать с двумерными структурами данных и создавать сложные визуальные эффекты с помощью простых символов. Понимание работы вложенных циклов является важным навыком для программирования в целом.
