# Практическая работа 4: Циклы `for` и `while`

## Цель работы
Научиться использовать циклы `for` и `while` в Python для решения задач:
- Вывод последовательностей
- Вычисление суммы/среднего
- Игра "угадай число"
- Таблица умножения

## Теоретическая часть
Циклы позволяют повторять выполнение блоков кода. В Python есть два основных типа циклов:
- `for` — для перебора элементов коллекции
- `while` — для выполнения кода до тех пор, пока условие истинно

### Синтаксис циклов:
```python
# Цикл for
for переменная in коллекция:
    # код для выполнения

# Цикл while
while условие:
    # код для выполнения
```

### Операторы управления:
- `break` — немедленный выход из цикла
- `continue` — пропуск текущей итерации

## Практические задания

### Задание 1: Вывод чисел от 1 до N
Напишите программу, которая запрашивает у пользователя число N и выводит все числа от 1 до N.

**Пример выполнения:**
```
Введите число N: 5
1
2
3
4
5
```

**Код для выполнения:**
```python
# Запрос числа у пользователя
N = int(input("Введите число N: "))

# Вывод чисел от 1 до N
for i in range(1, N + 1):
    print(i)
```

---

### Задание 2: Сумма чисел от 1 до N
Напишите программу, которая вычисляет сумму всех чисел от 1 до N, используя цикл.

**Пример выполнения:**
```
Введите число N: 5
Сумма чисел от 1 до 5: 15
```

**Код для выполнения:**
```python
# Запрос числа у пользователя
N = int(input("Введите число N: "))

# Вычисление суммы
sum = 0
for i in range(1, N + 1):
    sum += i

# Вывод результата
print(f"Сумма чисел от 1 до {N}: {sum}")
```

---

### Задание 3: Таблица умножения
Создайте программу, которая выводит таблицу умножения для заданного числа.

**Пример выполнения:**
```
Введите число для таблицы умножения: 3
Таблица умножения для 3:
3 x 1 = 3
3 x 2 = 6
3 x 3 = 9
3 x 4 = 12
3 x 5 = 15
3 x 6 = 18
3 x 7 = 21
3 x 8 = 24
3 x 9 = 27
3 x 10 = 30
```

**Код для выполнения:**
```python
# Запрос числа у пользователя
number = int(input("Введите число для таблицы умножения: "))

# Вывод таблицы умножения
print(f"Таблица умножения для {number}:")
for i in range(1, 11):
    result = number * i
    print(f"{number} x {i} = {result}")
```

---

### Задание 4: Среднее значение
Напишите программу, которая запрашивает у пользователя количество чисел, а затем вводит эти числа и вычисляет их среднее значение.

**Пример выполнения:**
```
Сколько чисел вы хотите ввести? 4
Введите число 1: 10
Введите число 2: 20
Введите число 3: 30
Введите число 4: 40
Среднее значение: 25.0
```

**Код для выполнения:**
```python
# Запрос количества чисел
count = int(input("Сколько чисел вы хотите ввести? "))

# Ввод чисел и вычисление суммы
total = 0
for i in range(count):
    number = float(input(f"Введите число {i + 1}: "))
    total += number

# Вычисление и вывод среднего значения
average = total / count if count > 0 else 0
print(f"Среднее значение: {average}")
```

---

### Задание 5: Игра "Угадай число"
Создайте игру, в которой компьютер загадывает число от 1 до 100, а пользователь пытается его угадать. Программа должна сообщать, больше или меньше загаданного введенное число.

**Пример выполнения:**
```
Я загадал число от 1 до 100. Попробуйте угадать!
Введите ваше предположение: 50
Загаданное число меньше
Введите ваше предположение: 25
Загаданное число больше
Введите ваше предположение: 37
Загаданное число больше
Введите ваше предположение: 43
Поздравляю! Вы угадали число за 4 попытки.
```

**Код для выполнения:**
```python
import random

# Компьютер загадывает число
secret_number = random.randint(1, 100)
attempts = 0

print("Я загадал число от 1 до 100. Попробуйте угадать!")

# Цикл угадывания
while True:
    guess = int(input("Введите ваше предположение: "))
    attempts += 1
    
    if guess < secret_number:
        print("Загаданное число больше")
    elif guess > secret_number:
        print("Загаданное число меньше")
    else:
        print(f"Поздравляю! Вы угадали число за {attempts} попытки.")
        break
```

---

### Задание 6: Факториал числа
Напишите программу, которая вычисляет факториал введенного числа. Факториал числа n (обозначается n!) — это произведение всех положительных целых чисел от 1 до n.

**Пример выполнения:**
```
Введите число: 5
Факториал 5 равен 120
```

**Код для выполнения:**
```python
# Запрос числа у пользователя
n = int(input("Введите число: "))

# Вычисление факториала
factorial = 1
for i in range(1, n + 1):
    factorial *= i

# Вывод результата
print(f"Факториал {n} равен {factorial}")
```

---

### Задание 7: Вывод четных чисел
Напишите программу, которая выводит все четные числа в заданном диапазоне [a, b].

**Пример выполнения:**
```
Введите начало диапазона: 3
Введите конец диапазона: 12
Четные числа в диапазоне [3, 12]: 4 6 8 10 12
```

**Код для выполнения:**
```python
# Запрос диапазона
a = int(input("Введите начало диапазона: "))
b = int(input("Введите конец диапазона: "))

# Вывод четных чисел
print(f"Четные числа в диапазоне [{a}, {b}]:", end=" ")
for i in range(a, b + 1):
    if i % 2 == 0:
        print(i, end=" ")
print()  # Переход на новую строку
```

---

### Задание 8: Обратный отсчет
Напишите программу, которая выполняет обратный отсчет от заданного числа до 0, используя цикл while.

**Пример выполнения:**
```
Введите число для обратного отсчета: 5
5
4
3
2
1
0
Пуск!
```

**Код для выполнения:**
```python
# Запрос числа у пользователя
n = int(input("Введите число для обратного отсчета: "))

# Обратный отсчет
while n >= 0:
    print(n)
    n -= 1

print("Пуск!")
```

---

### Задание 9: Подсчет букв в строке
Напишите программу, которая запрашивает строку и букву, а затем подсчитывает, сколько раз эта буква встречается в строке.

**Пример выполнения:**
```
Введите строку: программирование
Введите букву: р
Буква 'р' встречается 3 раза
```

**Код для выполнения:**
```python
# Запрос строки и буквы
text = input("Введите строку: ")
letter = input("Введите букву: ")

# Подсчет вхождений буквы
count = 0
for char in text:
    if char == letter:
        count += 1

# Вывод результата
print(f"Буква '{letter}' встречается {count} раза")
```

---

### Задание 10: Числа Фибоначчи
Напишите программу, которая выводит первые N чисел Фибоначчи. Числа Фибоначчи — это последовательность, в которой каждое следующее число равно сумме двух предыдущих: 0, 1, 1, 2, 3, 5, 8, 13...

**Пример выполнения:**
```
Сколько чисел Фибоначчи вывести? 8
0 1 1 2 3 5 8 13
```

**Код для выполнения:**
```python
# Запрос количества чисел
n = int(input("Сколько чисел Фибоначчи вывести? "))

# Вывод первых чисел Фибоначчи
if n <= 0:
    print("Количество чисел должно быть положительным")
elif n == 1:
    print(0)
elif n == 2:
    print("0 1")
else:
    # Вывод первых двух чисел
    a, b = 0, 1
    print(a, b, end=" ")
    
    # Вывод остальных чисел
    for i in range(2, n):
        c = a + b
        print(c, end=" ")
        a, b = b, c
    print()  # Переход на новую строку
```

---

## Дополнительные задания (по желанию)

### Задание 11: Проверка простоты числа
Напишите программу, которая проверяет, является ли введенное число простым (делится только на 1 и на само себя).

### Задание 12: Сумма цифр числа
Напишите программу, которая находит сумму цифр введенного числа.

## Контрольные вопросы
1. В чем разница между циклами `for` и `while`?
2. Когда лучше использовать `for`, а когда `while`?
3. Как работает функция `range()`?
4. Для чего используется оператор `break`?
5. Для чего используется оператор `continue`?
6. Как можно использовать вложенные циклы?
7. Как работает функция `enumerate()` в цикле `for`?

## Вывод
В ходе этой практической работы были освоены циклы `for` и `while` в Python, их применение для решения различных задач. Циклы позволяют эффективно повторять выполнение кода, что делает программы более универсальными и мощными.
